export default {
  /**
   * 南非语
   */
  af:'af',
  /**
   * 南非语
   */
  af_ZA:'af_ZA',
  /**
   * 阿拉伯语
   */
  ar:'ar',
  /**
   * 阿拉伯语(阿联酋)
   */
  ar_AE:'ar_AE',
  /**
   * 阿拉伯语(巴林)
   */
  ar_BH:'ar_BH',
  /**
   * 阿拉伯语(阿尔及利亚)
   */
  ar_DZ:'ar_DZ',
  /**
   * 阿拉伯语(埃及)
   */
  ar_EG:'ar_EG',
  /**
   * 阿拉伯语(伊拉克)
   */
  ar_IQ:'ar_IQ',
  /**
   * 阿拉伯语(约旦)
   */
  ar_JO:'ar_JO',
  /**
   * 阿拉伯语(科威特)
   */
  ar_KW:'ar_KW',
  /**
   * 阿拉伯语(黎巴嫩)
   */
  ar_LB:'ar_LB',
  /**
   * 阿拉伯语(利比亚)
   */
  ar_LY:'ar_LY',
  /**
   * 阿拉伯语(摩洛哥)
   */
  ar_MA:'ar_MA',
  /**
   * 阿拉伯语(阿曼)
   */
  ar_OM:'ar_OM',
  /**
   * 阿拉伯语(卡塔尔)
   */
  ar_QA:'ar_QA',
  /**
   * 阿拉伯语(沙特阿拉伯)
   */
  ar_SA:'ar_SA',
  /**
   * 阿拉伯语(叙利亚)
   */
  ar_SY:'ar_SY',
  /**
   * 阿拉伯语(突尼斯)
   */
  ar_TN:'ar_TN',
  /**
   * 阿拉伯语(也门)
   */
  ar_YE:'ar_YE',
  /**
   * 阿塞拜疆语
   */
  az:'az',
  /**
   * 阿塞拜疆语(拉丁文)
   */
  az_AZ:'az_AZ',
  /**
   * 比利时语
   */
  be:'be',
  /**
   * 比利时语
   */
  be_BY:'be_BY',
  /**
   * 保加利亚语
   */
  bg:'bg',
  /**
   * 保加利亚语
   */
  bg_BG:'bg_BG',
  /**
   * 波斯尼亚语(拉丁文，波斯尼亚和黑塞哥维那)
   */
  bs_BA:'bs_BA',
  /**
   * 加泰隆语
   */
  ca:'ca',
  /**
   * 加泰隆语
   */
  ca_ES:'ca_ES',
  /**
   * 捷克语
   */
  cs:'cs',
  /**
   * 捷克语
   */
  cs_CZ:'cs_CZ',
  /**
   * 威尔士语
   */
  cy:'cy',
  /**
   * 威尔士语
   */
  cy_GB:'cy_GB',
  /**
   * 丹麦语
   */
  da:'da',
  /**
   * 丹麦语
   */
  da_DK:'da_DK',
  /**
   * 德语
   */
  de:'de',
  /**
   * 德语(奥地利)
   */
  de_AT:'de_AT',
  /**
   * 德语(瑞士)
   */
  de_CH:'de_CH',
  /**
   * 德语(德国)
   */
  de_DE:'de_DE',
  /**
   * 德语(列支敦士登)
   */
  de_LI:'de_LI',
  /**
   * 德语(卢森堡)
   */
  de_LU:'de_LU',
  /**
   * 第维埃语
   */
  dv:'dv',
  /**
   * 第维埃语
   */
  dv_MV:'dv_MV',
  /**
   * 希腊语
   */
  el:'el',
  /**
   * 希腊语
   */
  el_GR:'el_GR',
  /**
   * 英语
   */
  en:'en',
  /**
   * 英语(澳大利亚)
   */
  en_AU:'en_AU',
  /**
   * 英语(伯利兹)
   */
  en_BZ:'en_BZ',
  /**
   * 英语(加拿大)
   */
  en_CA:'en_CA',
  /**
   * 英语(加勒比海)
   */
  en_CB:'en_CB',
  /**
   * 英语(英国)
   */
  en_GB:'en_GB',
  /**
   * 英语(爱尔兰)
   */
  en_IE:'en_IE',
  /**
   * 英语(牙买加)
   */
  en_JM:'en_JM',
  /**
   * 英语(新西兰)
   */
  en_NZ:'en_NZ',
  /**
   * 英语(菲律宾)
   */
  en_PH:'en_PH',
  /**
   * 英语(特立尼达)
   */
  en_TT:'en_TT',
  /**
   * 英语(美国)
   */
  en_US:'en_US',
  /**
   * 英语(南非)
   */
  en_ZA:'en_ZA',
  /**
   * 英语(津巴布韦)
   */
  en_ZW:'en_ZW',
  /**
   * 世界语
   */
  eo:'eo',
  /**
   * 西班牙语
   */
  es:'es',
  /**
   * 西班牙语(阿根廷)
   */
  es_AR:'es_AR',
  /**
   * 西班牙语(玻利维亚)
   */
  es_BO:'es_BO',
  /**
   * 西班牙语(智利)
   */
  es_CL:'es_CL',
  /**
   * 西班牙语(哥伦比亚)
   */
  es_CO:'es_CO',
  /**
   * 西班牙语(哥斯达黎加)
   */
  es_CR:'es_CR',
  /**
   * 西班牙语(多米尼加共和国)
   */
  es_DO:'es_DO',
  /**
   * 西班牙语(厄瓜多尔)
   */
  es_EC:'es_EC',
  /**
   * 西班牙语(传统)
   */
  es_ES:'es_ES',
  /**
   * 西班牙语(危地马拉)
   */
  es_GT:'es_GT',
  /**
   * 西班牙语(洪都拉斯)
   */
  es_HN:'es_HN',
  /**
   * 西班牙语(墨西哥)
   */
  es_MX:'es_MX',
  /**
   * 西班牙语(尼加拉瓜)
   */
  es_NI:'es_NI',
  /**
   * 西班牙语(巴拿马)
   */
  es_PA:'es_PA',
  /**
   * 西班牙语(秘鲁)
   */
  es_PE:'es_PE',
  /**
   * 西班牙语(波多黎各(美))
   */
  es_PR:'es_PR',
  /**
   * 西班牙语(巴拉圭)
   */
  es_PY:'es_PY',
  /**
   * 西班牙语(萨尔瓦多)
   */
  es_SV:'es_SV',
  /**
   * 西班牙语(乌拉圭)
   */
  es_UY:'es_UY',
  /**
   * 西班牙语(委内瑞拉)
   */
  es_VE:'es_VE',
  /**
   * 爱沙尼亚语
   */
  et:'et',
  /**
   * 爱沙尼亚语
   */
  et_EE:'et_EE',
  /**
   * 巴士克语
   */
  eu:'eu',
  /**
   * 巴士克语
   */
  eu_ES:'eu_ES',
  /**
   * 法斯语
   */
  fa:'fa',
  /**
   * 法斯语
   */
  fa_IR:'fa_IR',
  /**
   * 芬兰语
   */
  fi:'fi',
  /**
   * 芬兰语
   */
  fi_FI:'fi_FI',
  /**
   * 法罗语
   */
  fo:'fo',
  /**
   * 法罗语
   */
  fo_FO:'fo_FO',
  /**
   * 法语
   */
  fr:'fr',
  /**
   * 法语(比利时)
   */
  fr_BE:'fr_BE',
  /**
   * 法语(加拿大)
   */
  fr_CA:'fr_CA',
  /**
   * 法语(瑞士)
   */
  fr_CH:'fr_CH',
  /**
   * 法语(法国)
   */
  fr_FR:'fr_FR',
  /**
   * 法语(卢森堡)
   */
  fr_LU:'fr_LU',
  /**
   * 法语(摩纳哥)
   */
  fr_MC:'fr_MC',
  /**
   * 加里西亚语
   */
  gl:'gl',
  /**
   * 加里西亚语
   */
  gl_ES:'gl_ES',
  /**
   * 古吉拉特语
   */
  gu:'gu',
  /**
   * 古吉拉特语
   */
  gu_IN:'gu_IN',
  /**
   * 希伯来语
   */
  he:'he',
  /**
   * 希伯来语
   */
  he_IL:'he_IL',
  /**
   * 印地语
   */
  hi:'hi',
  /**
   * 印地语
   */
  hi_IN:'hi_IN',
  /**
   * 克罗地亚语
   */
  hr:'hr',
  /**
   * 克罗地亚语(波斯尼亚和黑塞哥维那)
   */
  hr_BA:'hr_BA',
  /**
   * 克罗地亚语
   */
  hr_HR:'hr_HR',
  /**
   * 匈牙利语
   */
  hu:'hu',
  /**
   * 匈牙利语
   */
  hu_HU:'hu_HU',
  /**
   * 亚美尼亚语
   */
  hy:'hy',
  /**
   * 亚美尼亚语
   */
  hy_AM:'hy_AM',
  /**
   * 印度尼西亚语
   */
  id:'id',
  /**
   * 印度尼西亚语
   */
  id_ID:'id_ID',
  /**
   * 冰岛语
   */
  is:'is',
  /**
   * 冰岛语
   */
  is_IS:'is_IS',
  /**
   * 意大利语
   */
  it:'it',
  /**
   * 意大利语(瑞士)
   */
  it_CH:'it_CH',
  /**
   * 意大利语(意大利)
   */
  it_IT:'it_IT',
  /**
   * 日语
   */
  ja:'it_IT',
  /**
   * 日语
   */
  ja_JP:'ja_JP',
  /**
   * 格鲁吉亚语
   */
  ka:'ka',
  /**
   * 格鲁吉亚语
   */
  ka_GE:'ka_GE',
  /**
   * 哈萨克语
   */
  kk:'kk',
  /**
   * 哈萨克语
   */
  kk_KZ:'kk_KZ',
  /**
   * 卡纳拉语
   */
  kn:'kn',
  /**
   * 卡纳拉语
   */
  kn_IN:'kn_IN',
  /**
   * 朝鲜语
   */
  ko:'ko',
  /**
   * 朝鲜语
   */
  ko_KR:'ko_KR',
  /**
   * 孔卡尼语
   */
  kok:'kok',
  /**
   * 孔卡尼语
   */
  kok_IN:'kok_IN',
  /**
   * 吉尔吉斯语
   */
  ky:'ky',
  /**
   * 吉尔吉斯语(西里尔文)
   */
  ky_KG:'ky_KG',
  /**
   * 立陶宛语
   */
  lt:'lt',
  /**
   * 立陶宛语
   */
  lt_LT:'lt_LT',
  /**
   * 拉脱维亚语
   */
  lv:'lv',
  /**
   * 拉脱维亚语
   */
  lv_LV:'lv_LV',
  /**
   * 毛利语
   */
  mi:'mi',
  /**
   * 毛利语
   */
  mi_NZ:'mi_NZ',
  /**
   * 马其顿语
   */
  mk:'mk',
  /**
   * 马其顿语(FYROM)
   */
  mk_MK:'mk_MK',
  /**
   * 蒙古语
   */
  mn:'mn',
  /**
   * 蒙古语(西里尔文)
   */
  mn_MN:'mn_MN',
  /**
   * 马拉地语
   */
  mr:'mr',
  /**
   * 马拉地语
   */
  mr_IN:'mr_IN',
  /**
   * 马来语
   */
  ms:'ms',
  /**
   * 马来语(文莱达鲁萨兰)
   */
  ms_BN:'ms_BN',
  /**
   * 马来语(马来西亚)
   */
  ms_MY:'ms_MY',
  /**
   * 马耳他语
   */
  mt:'mt',
  /**
   * 马耳他语
   */
  mt_MT:'mt_MT',
  /**
   * 挪威语(伯克梅尔)
   */
  nb:'nb',
  /**
   * 挪威语(伯克梅尔)(挪威)
   */
  nb_NO:'nb_NO',
  /**
   * 荷兰语
   */
  nl:'nl',
  /**
   * 荷兰语(比利时)
   */
  nl_BE:'nl_BE',
  /**
   * 荷兰语(荷兰)
   */
  nl_NL:'nl_NL',
  /**
   * 挪威语(尼诺斯克)(挪威)
   */
  nn_NO:'nn_NO',
  /**
   * 北梭托语
   */
  ns:'ns',
  /**
   * 北梭托语
   */
  ns_ZA:'ns_ZA',
  /**
   * 旁遮普语
   */
  pa:'pa',
  /**
   * 旁遮普语
   */
  pa_IN:'pa_IN',
  /**
   * 波兰语
   */
  pl:'pl',
  /**
   * 波兰语
   */
  pl_PL:'pl_PL',
  /**
   * 葡萄牙语
   */
  pt:'pt',
  /**
   * 葡萄牙语(巴西)
   */
  pt_BR:'pt_BR',
  /**
   * 葡萄牙语(葡萄牙)
   */
  pt_PT:'pt_PT',
  /**
   * 克丘亚语
   */
  qu:'qu',
  /**
   * 克丘亚语(玻利维亚)
   */
  qu_BO:'qu_BO',
  /**
   * 克丘亚语(厄瓜多尔)
   */
  qu_EC:'qu_EC',
  /**
   * 克丘亚语(秘鲁)
   */
  qu_PE:'qu_PE',
  /**
   * 罗马尼亚语
   */
  ro:'ro',
  /**
   * 罗马尼亚语
   */
  ro_RO:'ro_RO',
  /**
   * 俄语
   */
  ru:'ru',
  /**
   * 俄语
   */
  ru_RU:'ru_RU',
  /**
   * 梵文
   */
  sa:'sa',
  /**
   * 梵文
   */
  sa_IN:'sa_IN',
  /**
   * 北萨摩斯语
   */
  se:'se',
  /**
   * 北萨摩斯语(芬兰)
   */
  se_FI:'se_FI',
  /**
   * 伊那里萨摩斯语
   */
  se_NO:'se_NO',
  /**
   * 南萨摩斯语
   */
  se_SE:'se_SE',
  /**
   * 斯洛伐克语
   */
  sk:'sk',
  /**
   * 斯洛伐克语
   */
  sk_SK:'sk_SK',
  /**
   * 斯洛文尼亚语
   */
  sl:'sl',
  /**
   * 斯洛文尼亚语
   */
  sl_SI:'sl_SI',
  /**
   * 阿尔巴尼亚语
   */
  sq:'sq',
  /**
   * 阿尔巴尼亚语
   */
  sq_AL:'sq_AL',
  /**
   * 塞尔维亚语(拉丁文，波斯尼亚和黑塞哥维那)
   */
  sr_BA:'sr_BA',
  /**
   * 塞尔维亚(拉丁)
   */
  sr_SP:'sr_SP',
  /**
   * 瑞典语
   */
  sv:'sv',
  /**
   * 瑞典语(芬兰)
   */
  sv_FI:'sv_FI',
  /**
   * 瑞典语
   */
  sv_SE:'sv_SE',
  /**
   * 斯瓦希里语
   */
  sw:'sw',
  /**
   * 斯瓦希里语
   */
  sw_KE:'sw_KE',
  /**
   * 叙利亚语
   */
  syr:'syr',
  /**
   * 叙利亚语
   */
  syr_SY:'syr_SY',
  /**
   * 泰米尔语
   */
  ta:'ta',
  /**
   * 泰米尔语
   */
  ta_IN:'ta_IN',
  /**
   * 泰卢固语
   */
  te:'te',
  /**
   * 泰卢固语
   */
  te_IN:'te_IN',
  /**
   * 泰语
   */
  th:'th',
  /**
   * 泰语
   */
  th_TH:'th_TH',
  /**
   * 塔加路语
   */
  tl:'tl',
  /**
   * 塔加路语(菲律宾)
   */
  tl_PH:'tl_PH',
  /**
   * 茨瓦纳语
   */
  tn:'tn',
  /**
   * 茨瓦纳语
   */
  tn_ZA:'tn_ZA',
  /**
   * 土耳其语
   */
  tr:'tr',
  /**
   * 土耳其语
   */
  tr_TR:'tr_TR',
  /**
   * 宗加语
   */
  ts:'ts',
  /**
   * 鞑靼语
   */
  tt:'tt',
  /**
   * 鞑靼语
   */
  tt_RU:'tt_RU',
  /**
   * 乌克兰语
   */
  uk:'uk',
  /**
   * 乌克兰语
   */
  uk_UA:'uk_UA',
  /**
   * 乌都语
   */
  ur:'ur',
  /**
   * 乌都语
   */
  ur_PK:'ur_PK',
  /**
   * 乌兹别克语
   */
  uz:'uz',
  /**
   * 乌兹别克语(拉丁文)
   */
  uz_UZ:'uz_UZ',
  /**
   * 越南语
   */
  vi:'vi',
  /**
   * 越南语
   */
  vi_VN:'vi_VN',
  /**
   * 班图语
   */
  xh:'xh',
  /**
   * 班图语
   */
  xh_ZA:'xh_ZA',
  /**
   * 中文
   */
  zh:'zh',
  /**
   * 中文(简体)
   */
  zh_CN:'zh_CN',
  /**
   * 中文(香港)
   */
  zh_HK:'zh_HK',
  /**
   * 中文(澳门)
   */
  zh_MO:'zh_MO',
  /**
   * 中文(新加坡)
   */
  zh_SG:'zh_SG',
  /**
   * 中文(繁体)
   */
  zh_TW:'zh_TW',
  /**
   * 祖鲁语
   */
  zu:'zu',
  /**
   * 祖鲁语
   */
  zu_ZA: 'zu_ZA',
}


